pdxagc/F103_handwheel_control/STM32/DCDEMO7/src/main.c
		 case Setting_page:  //***********************************************************设置页面*************************************************************************************************
 		 {
	     if(pram_status.Screen_ID1_Setting_concel)     //取消按钮按下
			 {
					Speaker_Key_Process(pram_status.Voice_last_status);	      //语音提示按钮处理函数
					Safe_Z_process(pram_status.Safe_Z_last_status);           //安全Z触发处理函数
					Auto_Knife_process(pram_status.Auto_Knife_last_status);   //自动对刀按钮触发后处理程序
					Unit_Change_process(pram_status.Unit_Change_last_status);	//单位切换按钮触发后处理程序
				 
				  pram_status.Screen_ID1_Setting_concel=0;
          Work_Page_Status=Working_Page;				 
			 }		
			}
			break;
			case Save_Pram_Page:  //****************************************************提示是否保存参数设置****************************************************************************************
			{
				if(state.Work_state==Stop)      //停止加工
				{
					if(pram_status.Screen_ID21_Setting_Sure)                    //“确定按钮”按下
					{
						Speaker_Key_Process(pram_status.voice_button_status);     //语音提示按钮处理函数
						Safe_Z_process(pram_status.Safe_Z_button_satus);           //安全Z触发处理函数
						Auto_Knife_process(pram_status.Auto_Knife_button_status);  //自动对刀按钮触发后处理程序
						Unit_Change_process(pram_status.Unit_Change_button_status); //单位切换按钮触发后处理程序
						Work_Page_Status=Working_Page;
					}
					if(pram_status.Screen_ID21_Setting_concel)                    //取消按钮按下
					{
						Speaker_Key_Process(pram_status.Voice_last_status);	      //语音提示按钮处理函数
						Safe_Z_process(pram_status.Safe_Z_last_status);           //安全Z触发处理函数
						Auto_Knife_process(pram_status.Auto_Knife_last_status);
						Unit_Change_process(pram_status.Unit_Change_last_status);
						Work_Page_Status=Working_Page;					
					}	
			  }				
			}
			break;	
			case ControlPanel_Page:  //******************************************************控制面板页面*****************************************************************************************
			{
				char buf2[20];
        if(state.Work_state==Stop)	                          //停止加工
				{					
					if(control_panel_pram.X_press)                       //X轴选定状态***************************************************************                   
					{
						if(control_panel_pram.Clear_Button==0 && control_panel_pram.All_Spindle_Clear_Button==0)
						{
							if(override.Override_num_temp_X != override.Override_num)   //倍率切换
							{	 
							   control_panel_pram.X_value_temp = control_panel_pram.X_value;
								 override.Override_num_temp_X = override.Override_num;
								 TIM4->CNT = 0;
								 Pulses_counter = 0;
							   Pulses_num_temp = 0;
							}
              Get_Pulses_num();   //计算脉冲个数							
							control_panel_pram.X_Pulses_counter=Pulses_counter;						
							control_panel_pram.X_value=control_panel_pram.X_value_temp+Pulses_counter*override.Override_num;
							sprintf((char *)buf2,"%09.2f",control_panel_pram.X_value);
							SetTextValue(2,17,(uchar *)buf2);	        //在手轮上显示工件坐标
							SetTextValue(0,16,(uchar *)buf2);         //在手轮上显示工件坐标
							
						}
						if(control_panel_pram.Clear_Button && control_panel_pram.All_Spindle_Clear_Button==0)    //清零按钮触发
						{
							TIM4->CNT = 0;
							Pulses_counter=0;
							Pulses_num_temp=0;
							control_panel_pram.X_value_temp=0;
							control_panel_pram.X_Pulses_counter=0;							
              X_coordinate_clear();                    //对X轴工件坐标清零	
							control_panel_pram.Clear_Button=0;						
						}
						if( control_panel_pram.Clear_Button==0 && control_panel_pram.All_Spindle_Clear_Button)  //全轴清零触发
						{
							
							Pulses_num_Clear();                    //脉冲数量清零
						  All_Workpiece_coordinate_clear();      //对所有轴工件坐标清零							
							XYZAB_button_reset();                  //XYZAB坐标按钮复位
							control_panel_pram.All_Spindle_Clear_Button=0;
						}
						
					}
					else if(control_panel_pram.Y_press)                   //Y轴选定状态*******************************************************
					{
						if(control_panel_pram.Clear_Button==0 && control_panel_pram.All_Spindle_Clear_Button==0)
						{
							if(override.Override_num_temp_Y!= override.Override_num)   //倍率切换
							{	 
							   control_panel_pram.Y_value_temp=control_panel_pram.Y_value;
								 override.Override_num_temp_Y=override.Override_num;
								 TIM4->CNT=0;
								 Pulses_counter=0;
							   Pulses_num_temp=0;
							}
							Get_Pulses_num();
							control_panel_pram.Y_Pulses_counter=Pulses_counter;
							control_panel_pram.Y_value=control_panel_pram.Y_value_temp+Pulses_counter*override.Override_num;
							sprintf((char *)buf2,"%09.2f",control_panel_pram.Y_value);
							SetTextValue(2,18,(uchar *)buf2);
							SetTextValue(0,17,(uchar *)buf2);         //在手轮上显示工件坐标
							
						}
						if(control_panel_pram.Clear_Button && control_panel_pram.All_Spindle_Clear_Button==0)    //清零按钮触发
						{
							TIM4->CNT = 0;
							Pulses_counter=0;
	            Pulses_num_temp=0;
							control_panel_pram.Y_value_temp=0;
							control_panel_pram.Y_Pulses_counter=0;
							delay_ms(20);							
              Y_coordinate_clear();                   //对Y轴工件坐标清零
							control_panel_pram.Clear_Button=0;
						}
						if( control_panel_pram.Clear_Button==0 && control_panel_pram.All_Spindle_Clear_Button)  //全轴清零触发
						{
							Pulses_num_Clear();                    //脉冲数量清零
						  All_Workpiece_coordinate_clear();      //对所有工件坐标清零														
							XYZAB_button_reset();                   //XYZAB坐标按钮复位
							control_panel_pram.All_Spindle_Clear_Button=0;
						}
						
					}
					else if(control_panel_pram.Z_press)                   //Z轴选定状态**********************************************************
					{
						if(control_panel_pram.Clear_Button==0 && control_panel_pram.All_Spindle_Clear_Button==0)
						{
							if(override.Override_num_temp_Z != override.Override_num)   //倍率切换
							{	 
							   control_panel_pram.Z_value_temp=control_panel_pram.Z_value;
								 override.Override_num_temp_Z = override.Override_num;
								 TIM4->CNT=0;
							 	 Pulses_counter=0;
							   Pulses_num_temp=0;
							}
							Get_Pulses_num();
							control_panel_pram.Z_Pulses_counter=Pulses_counter;
							control_panel_pram.Z_value=control_panel_pram.Z_value_temp+Pulses_counter*override.Override_num;
							sprintf((char *)buf2,"%09.2f",control_panel_pram.Z_value);
							SetTextValue(2,19,(uchar *)buf2);
							SetTextValue(0,18,(uchar *)buf2);        //在手轮上显示工件坐标
							
