pdxagc/F103_handwheel_control/STM32/DCDEMO7/src/main.c
						}
						if(control_panel_pram.Clear_Button && control_panel_pram.All_Spindle_Clear_Button==0)    //清零按钮触发
						{
							TIM4->CNT = 0;
							Pulses_counter=0;
	            Pulses_num_temp=0;
							control_panel_pram.Z_value_temp=0;
							control_panel_pram.Z_Pulses_counter=0;
							delay_ms(20);						
              Z_coordinate_clear();         //对Z轴工件坐标清零
							control_panel_pram.Clear_Button=0;						
						}
						if( control_panel_pram.Clear_Button==0 && control_panel_pram.All_Spindle_Clear_Button)  //全轴清零触发
						{
							Pulses_num_Clear();                    //脉冲数量清零
						  All_Workpiece_coordinate_clear();      //对所有工件坐标清零								
							XYZAB_button_reset();                  //XYZAB坐标按钮复位
							control_panel_pram.All_Spindle_Clear_Button=0;
						}
					
					}
					else if(control_panel_pram.A_press)                   //A轴选定状态************************************************************************
					{
						if(control_panel_pram.Clear_Button==0 && control_panel_pram.All_Spindle_Clear_Button==0)
						{
							if(override.Override_num_temp_A != override.Override_num)   //倍率切换
							{	 
							   control_panel_pram.A_value_temp = control_panel_pram.A_value;
								 override.Override_num_temp_A = override.Override_num;
								 TIM4->CNT=0;
								 Pulses_counter=0;
							   Pulses_num_temp=0;
							}
							Get_Pulses_num();
							control_panel_pram.A_Pulses_counter=Pulses_counter;
							control_panel_pram.A_value=control_panel_pram.A_value_temp+Pulses_counter*override.Override_num;
							sprintf((char *)buf2,"%09.2f",control_panel_pram.A_value);
							SetTextValue(2,20,(uchar *)buf2);
							SetTextValue(0,19,(uchar *)buf2);         //在手轮上显示工件坐标
							
						}
						if(control_panel_pram.Clear_Button && control_panel_pram.All_Spindle_Clear_Button==0)    //清零按钮触发
						{
							TIM4->CNT = 0;
							Pulses_counter=0;
	            Pulses_num_temp=0;
							control_panel_pram.A_value_temp=0;
							control_panel_pram.A_Pulses_counter=0;
							delay_ms(20);
							
              A_coordinate_clear();                  //对A轴工件坐标清零
							control_panel_pram.Clear_Button=0;
						}
						if( control_panel_pram.Clear_Button==0 && control_panel_pram.All_Spindle_Clear_Button)  //全轴清零触发
						{
							Pulses_num_Clear();                    //脉冲数量清零
						  All_Workpiece_coordinate_clear();      //对所有工件坐标清零								
							XYZAB_button_reset();                  //XYZAB坐标按钮复位
							control_panel_pram.All_Spindle_Clear_Button=0;
						}
																							
					}
					else if(control_panel_pram.B_press)                   //B轴选定状态*****************************************************************************
					{
						if(control_panel_pram.Clear_Button==0 && control_panel_pram.All_Spindle_Clear_Button==0)
						{
							if(override.Override_num_temp_B!= override.Override_num)   //倍率切换
							{	 
							   control_panel_pram.B_value_temp=control_panel_pram.B_value;
								 override.Override_num_temp_B= override.Override_num;
								 TIM4->CNT=0;
								 Pulses_counter=0;
							   Pulses_num_temp=0;
							}
							Get_Pulses_num();
							control_panel_pram.B_Pulses_counter=Pulses_counter;
							control_panel_pram.B_value=control_panel_pram.B_value_temp+Pulses_counter*override.Override_num;
							sprintf((char *)buf2,"%09.2f",control_panel_pram.B_value);
							SetTextValue(2,21,(uchar *)buf2);
							SetTextValue(0,20,(uchar *)buf2);         //在手轮上显示工件坐标
							
						}
						if(control_panel_pram.Clear_Button && control_panel_pram.All_Spindle_Clear_Button==0)    //清零按钮触发
						{
							TIM4->CNT = 0;
							Pulses_counter=0;
	            Pulses_num_temp=0;
							control_panel_pram.B_value_temp=0;
							control_panel_pram.B_Pulses_counter=0;
							delay_ms(20);		
              B_coordinate_clear();                      	//对B轴工件坐标清零
							control_panel_pram.Clear_Button=0;
						}
						if( control_panel_pram.Clear_Button==0 && control_panel_pram.All_Spindle_Clear_Button)  //全轴清零触发
						{
							Pulses_num_Clear();                  //脉冲数量清零
						  All_Workpiece_coordinate_clear();    //对所有工件坐标清零								
							XYZAB_button_reset();                //XYZAB坐标按钮复位
							control_panel_pram.All_Spindle_Clear_Button=0;
						}				
					}
					
					if(control_panel_pram.X_press || control_panel_pram.Y_press || control_panel_pram.Z_press || control_panel_pram.A_press || control_panel_pram.B_press)
					{
						TIM_Cmd(TIM2, ENABLE);                    //使能TIM2，定时向主机发送坐标
						if(Send_cooddinate_status)
						{
					     Send_Coordinate_to_Host_Machine();                //向主机发送坐标	
							 Send_cooddinate_status=0;
						}							
					}
					else 
					{
					   TIM_Cmd(TIM2, DISABLE);
					}
          					
			  }
				else                                                 //机器处于加工状态中
				{
					 TIM_Cmd(TIM3, ENABLE);                        //使能 TIM3
					// TIM_Cmd(TIM4, DISABLE);                       //禁止TIM4
					 TFT_Show_coordanate_value();			             //显示工件和机械坐标
					
					 SetTextValue(0,21,(uchar *)file_name);        //显示正在加载的文件名	         				
					 sprintf(Working_line_buf,"%d",Working_line);  
					 SetTextValue(0,22,(uchar *)Working_line_buf); //显示加工行数，需要向主机询问
				
				}
				
			}break;
			case Return_WorkPiece_Zero_Page: 
				break;
			case Jump_Work_Page:
				break;
			case File_Manage_Page: 
				break;
			case Leading_In_Page: 
				break;
			case Delete_Page: 
				break;
			case Storage_View_Page: 
				break;
		
			case Net_Account_Manage_Page:  //**************************************************网络与账户登录管理**********************************************************************************
				{
					switch(get_control_type)                              //控件类型判断
					{
						case kCtrlButton:                                   //按钮控件
						{							
													
							
						}break;						
						case kCtrlText:                                     //文本控件
						{
							switch(get_control_id)
							{
								case 7:
								{
									SetTextValue(11,8,(uchar *)input_buf);
								
