pdxagc/F103_handwheel_control/STM32/DCDEMO7/src/main.c
									default: break;		
                 }									
						}					
					}break;   
					case 2:                                       //画面2
					{
							Work_Page_Status=ControlPanel_Page;
							switch(get_control_id)
							{
                  case 1:                                           //清零按钮触发
									{
										if(state.Work_state==Start)    //开始加工
										{									
										}
										else                          //停止加工
										{
											control_panel_pram.Clear_Button=1;     
										}
									}break;    
                  case 2:                                             //回机械零按钮触发	
                  {
										if(state.Work_state==Start)    //开始加工
										{									
										}
										else                           //停止加工
										{
										}
									}break;                                     									
									case 3:								                              //倍率切换按钮触发
									{
										if(state.Work_state==Start)      //开始加工
										{
										}
										else                             //停止加工
										{
											if(get_button_state)
											{
													control_panel_pram.Override_Change_button=1;
													Override_Change_Process();//倍率切换控制											
											}
											get_button_state=0;	
										}											
									}break;
								  case 4:                                             //主轴开关按钮触发
									{
										if(state.Work_state==Start)    //开始加工
										{									
										}
										else                           //停止加工
										{
										}
									}break;
			            case 5:                                              //全轴清零按钮触发
									{
                    if(state.Work_state==Start)     //开始加工
										{
										}
										else                            //停止加工
										{										
												control_panel_pram.All_Spindle_Clear_Button=1;
												TIM_Cmd(TIM4, DISABLE);       //关闭TIM4定时器
										}
									}break;
									case 6:                                            //回工件零按钮触发
									{
										if(state.Work_state==Start)    //开始加工
										{									
										}
										else                           //停止加工
										{
											Work_Page_Status=Return_WorkPiece_Zero_Page;
										}
									}break;
									case 7:                                            //坐标切换按钮触发
									{
										if(state.Work_state==Start)     //开始加工
										{
										}
										else                           //停止加工
										{
											if(get_button_state)
											{										
												  Coordinate_Change_Process();//坐标切换控制
												  get_button_state=0;
											 }
										}											
									}break;
									case 8:                                            //软限位开关按钮触发
									{
										if(state.Work_state==Start)    //开始加工
										{									
										}
										else                           //停止加工
										{
										}
									}break;
									case 9:                                            //安全Z按钮触发
									{
										if(state.Work_state==Start)    //开始加工
										{									
										}
										else                           //停止加工
										{
										}
									}break;
									case 10:                                         //跳行加工按钮触发
									{
										if(state.Work_state==Start)    //开始加工
										{									
										}
										else                           //停止加工
										{
											Work_Page_Status=Jump_Work_Page;
										}
									}break;
									case 11:                                          //对刀按钮触发
									{
										if(state.Work_state==Start)    //开始加工
										{									
										}
										else                           //停止加工
										{
											Work_Page_Status=Jump_Work_Page;
										}
									}break;
									case 12:                                         //分中按钮触发
									{
										if(state.Work_state==Start)    //开始加工
										{									
										}
										else                           //停止加工
										{
											Work_Page_Status=Jump_Work_Page;
										}
									}break;
									case 13:                                           //开始按钮触发
									{
										state.Work_state=Start;
										TIM_Cmd(TIM3, ENABLE);      //使能 TIM3
										TIM_Cmd(TIM4, DISABLE);      //禁止 TIM4
										SetButtonValue(2,14,0);     //停止按钮松开状态
										SetButtonValue(2,13,1);     //开始按钮按下状态										
									}break;
									case 14:                                           //停止按钮触发
									{
										state.Work_state=Stop;
										TIM_Cmd(TIM3, DISABLE);     //禁止 TIM3
										SetButtonValue(2,13,0);     //开始按钮松开状态
										SetButtonValue(2,14,1);     //停止按钮按下状态
                    if(control_panel_pram.X_press || control_panel_pram.Y_press || control_panel_pram.Z_press || control_panel_pram.A_press || control_panel_pram.B_press)
										{
										  TIM_Cmd(TIM4, ENABLE);      //使能 TIM4
										}											
									}break;
									case 15:                                            //复位按钮触发
									{
										state.Work_state=Stop;
										TIM_Cmd(TIM3, DISABLE);      //禁止 TIM3
										SetButtonValue(2,13,0);      //开始按钮松开状态
										SetButtonValue(2,14,1);      //停止按钮按下状态						
									}break;
									case 16:Work_Page_Status=Working_Page;break;
									case 22:                                            //X轴按钮触发
									{	
										SetButtonValue(2,22,1);     //X轴保持选中状态
										TIM_Cmd(TIM4, ENABLE);      //启动TIM4定时器									
										if(control_panel_pram.X_press==0)
										{
											TIM4->CNT = control_panel_pram.X_Pulses_counter*4;
                      Pulses_counter=0;											
										}
										control_panel_pram.X_press=1;
										control_panel_pram.Y_press=0;
										control_panel_pram.Z_press=0;
										control_panel_pram.A_press=0;
										control_panel_pram.B_press=0;									
									}break;
									case 23:                                            //Y轴按钮触发
									{
										SetButtonValue(2,23,1);        //Y轴保持选中状态
										TIM_Cmd(TIM4, ENABLE);         //启动TIM4定时器
										if(control_panel_pram.Y_press==0)
										{
											 TIM4->CNT = control_panel_pram.Y_Pulses_counter*4;
                       Pulses_counter=0;											
										}
										control_panel_pram.X_press=0;
										control_panel_pram.Y_press=1;
										control_panel_pram.Z_press=0;
										control_panel_pram.A_press=0;
										control_panel_pram.B_press=0;
							
									}break;
									case 24:                                              //Z轴按钮触发
									{
										SetButtonValue(2,24,1);         //Z轴保持选中状态
										TIM_Cmd(TIM4, ENABLE);          //启动TIM4定时器
										if(control_panel_pram.Z_press==0)
										{
											TIM4->CNT = control_panel_pram.Z_Pulses_counter*4;
                      Pulses_counter=0;											
										}
										control_panel_pram.X_press=0;
										control_panel_pram.Y_press=0;
										control_panel_pram.Z_press=1;
										control_panel_pram.A_press=0;
										control_panel_pram.B_press=0;						
									}break;
									case 25:                                             //A轴按钮触发
									{
										SetButtonValue(2,25,1);         //A轴保持选中状态
										TIM_Cmd(TIM4, ENABLE);          //启动TIM4定时器
										if(control_panel_pram.A_press==0)
										{
											TIM4->CNT = control_panel_pram.A_Pulses_counter*4;	
                      Pulses_counter=0;											
										}
										control_panel_pram.X_press=0;
										control_panel_pram.Y_press=0;
										control_panel_pram.Z_press=0;
										control_panel_pram.A_press=1;
										control_panel_pram.B_press=0;						
									}break;
									case 26:                                           //B轴按钮触发
									{
										  SetButtonValue(2,26,1);     //B轴保持选中状态
											TIM_Cmd(TIM4, ENABLE);      //启动TIM4定时器
											if(control_panel_pram.B_press==0)
											{
												TIM4->CNT = control_panel_pram.B_Pulses_counter*4;
                        Pulses_counter=0;												
											}
											control_panel_pram.X_press=0;
											control_panel_pram.Y_press=0;
											control_panel_pram.Z_press=0;
											control_panel_pram.A_press=0;
											control_panel_pram.B_press=1;
									}break;
									default:break;				
							}
					}break;
					case 3: Work_Page_Status=Return_WorkPiece_Zero_Page;break;  //画面3
					case 5: Work_Page_Status=Jump_Work_Page;break;              //画面5
					case 6:                                                     //画面6
					{
						Work_Page_Status=File_Manage_Page;
						switch(get_control_id)
						{
							case 1: Work_Page_Status=Leading_In_Page;break;
							case 2: Work_Page_Status=Leading_Out_Pgae;break;
							case 3: Work_Page_Status=Delete_Page;break;
							case 4: Work_Page_Status=Storage_View_Page;break;
							case 5: Work_Page_Status=Working_Page;break;
							case 18:Work_Page_Status=Working_Page;break;
							case 19:Work_Page_Status=Net_Account_Manage_Page;break;
							default:break;
						}
					}break;
					case 7: Work_Page_Status=Leading_In_Page;break;            //画面7
					case 9: Work_Page_Status=Delete_Page;break;                //画面8
					case 10: Work_Page_Status=Storage_View_Page;break;         //画面10
					case 11:                                                   //画面10
					{
						Work_Page_Status=Net_Account_Manage_Page;
						switch(get_control_id)
						{
							case 1: Work_Page_Status=Working_Page;break;
							case 2: Work_Page_Status=File_Manage_Page;break;
							case 3: Work_Page_Status=Choose_WiFi_Page;break;
							default:break;
						}
					}break;
					case 12: Work_Page_Status=Choose_WiFi_Page;break;
					case 13: Work_Page_Status=Disconnet_and_SignIn_Page;break;
					case 14: Work_Page_Status=Disconnect_and_SignOut_Page;break;
					case 15: Work_Page_Status=Disconnect_Remind_Page;break;
					case 16: Work_Page_Status=SignOut_Remind_Page;break;
					case 20: Work_Page_Status=Leading_Out_Pgae;break;
					case 21:                                                  //画面21
					{
						Work_Page_Status=Save_Pram_Page;
						if(state.Work_state==Stop)    //停止加工状态
						{
								switch(get_control_id)
								{
									case 1:    //确定按钮触发
									{							
										pram_status.Screen_ID21_Setting_Sure=1;
										pram_status.Screen_ID21_Setting_concel=0;
									}break;
									case 2:   //取消按钮触发
									{
										pram_status.Screen_ID21_Setting_Sure=0;
										pram_status.Screen_ID21_Setting_concel=1;						
									}
									default: break;	
								}
					  }
					}break;
					default: break;						
  			}
        
     }
		 
}


/*! 
*  \brief  文本控件通知
*  \details  当文本通过键盘更新(或调用GetControlValue)时，执行此函数
*  \details  文本控件的内容以字符串形式下发到MCU，如果文本控件内容是浮点值，
*  \details  则需要在此函数中将下发字符串重新转回浮点值。
*  \param str 文本控件内容
*  \pram  value 存放文本内容
*/
float NotifyText(uint8 *str)
{                                                                          
		float value=0;                                                            
		sscanf((char *)str,"%f",&value);                                            //把字符串转换为整数 
     return  value;                                                                      
}                                                                                

